{
    "translations": {
        "Pepper-Bell": "ದೊಣ್ಣೆ ಮೆಣಸಿನ ಕಾಯಿ",
        "Bacterial Spot": "ಎಲೆಯ ಮೇಲಿನ ರೋಗ",
        "Potato": "ಆಲೂಗಡ್ಡೆ",
        "Early Blight": "ಆರಂಭಿಕ ರೋಗ",
        "Late Blight": "ತಡವಾದ ರೋಗ",
        "Healthy": "ಆರೋಗ್ಯಕರ",
        "Tomato": "ಟೊಮೆಟೊ",
        "Leaf Mold": "ಬೂಸು",
        "Septoria Leaf Spot": "ಟೊಮೆಟೊ ಸೆಪ್ಟೋರಿಯಾ ಎಲೆ ಮೇಲಿನ ರೋಗ",
        "Spider Mites Two Spotted Spider Mite": "ಟೊಮೆಟೊ ಜೇಡ ಹುಳಗಳು ಎರಡು ಮಚ್ಚೆಯುಳ್ಳ ಜೇಡ ಹುಳ",
        "Target Spot": " ಗುರಿಯ ತಾಣದ ರೋಗ",
        "YellowLeaf Curl_Virus": " ಟೊಮೇಟೊ ಯೆಲ್ಲೋಲೀಫ್ ಕರ್ಲ್ ವೈರಸ್",
        "Mosaic Virus": "Mosaic Virus"
    },
    "diseases": {
        "Pepper-Bell Bacterial Spot": {
            "description":"ಈ ರೋಗವು ಬ್ಯಾಕ್ಟೀರಿಯಾದಿಂದ/ ಅಣು ಜೀವಿಯಿಂದ ಉಂಟಾಗುತ್ತದೆ...",
            "solution": "ಕಬ್ಬಿಣ ಆಧಾರಿತ ಹುಣಸುಗಳನ್ನು ಬಳಸಿ ಮತ್ತು ಮೇಲ್ದಬ್ಬಿ ನೀರು ಸೇರುವುದನ್ನು ತಪ್ಪಿಸಿ."
        },
        "Pepper-Bell Healthy": {
            "description": "ಆರೋಗ್ಯಕರ ಬೆಲ್ಲ್ ಮೆಣಸು ಸಸ್ಯಗಳು ಉತ್ತೇಜಕ ಹಸಿರು ಎಲೆಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತವೆ...",
            "solution": "ಕಾರ್ಯಾಚರಣೆಯ ಅಗತ್ಯವಿಲ್ಲ; ಉತ್ತಮ ಬೆಳೆಯುವ ಪರಿಸ್ಥಿತಿಗಳನ್ನು ಕಾಪಾಡಿ."
        },
        "Potato Early Blight": {
            "description": "ಆಲೂಗಡ್ಡೆ ಆರಂಭಿಕ ರೋಗವು ಆಲ್ಟರ್ನೇರಿಯಾ ಸೋಲಾನಿ ಎಂಬ ಶಿಲೆಂದ್ರದಿಂದ ಆಗುತ್ತದೆ. ಇದು ಉಷ್ಣ, ತೇವಾಂಶಯುತ ಪರಿಸ್ಥಿತಿಯಲ್ಲಿ ಹಕ್ಕಿಸುವಾಗ ಮತ್ತು ಗಾಳಿಯಿಂದ, ಮಳೆ ಮತ್ತು ಸಂಪೂರ್ಣವಾದ ಉಪಕರಣಗಳ ಮೂಲಕ ಹರಡಬಹುದು.",
            "solution": "ಹುಣಸುಗಳನ್ನು ಬಳಸಿ ಮತ್ತು ಕ್ರಾಪ್ ತಿರುವನ್ನು ಅಭ್ಯಾಸ ಮಾಡಿ."
        },
        "Potato Late Blight": {
            "description": "ಇದು ಫೈಟೊಫ್ಥೊರಾ ಇನ್ಫೆಸ್ಟಾನ್ಸ್ ಎಂಬ ರೋಗಾರಕದಿಂದ ಆಗುತ್ತದೆ, ಇದು ತಂಪಾದ ತೇವಾಂಶಯುತ ಪರಿಸ್ಥಿತಿಯಲ್ಲಿ ಹೆಚ್ಚಿನ ಹಾನಿಯನ್ನು ಉಂಟುಮಾಡಲು ಪ್ರಸಿದ್ಧವಾಗಿದೆ.",
            "solution":  "ವಿರೋಧಿ ಬಗೆಯನ್ನ ಬಳಸಲು ಮತ್ತು ನಿಯಮಿತವಾಗಿ ಹುಣಸುಗಳನ್ನು ಹಾಕಲು."
        },
        "Potato Healthy": {
            "description": "ಆರೋಗ್ಯಕರ ಆಲೂಗೆಡ್ಡೆ ಸಸ್ಯಗಳು ಉತ್ತೇಜಕ ಹಸಿರು ಎಲೆಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತವೆ...",
            "solution": "ಕಾರ್ಯಾಚರಣೆಯ ಅಗತ್ಯವಿಲ್ಲ; ಉತ್ತಮ ಬೆಳೆಯುವ ಪರಿಸ್ಥಿತಿಗಳನ್ನು ಕಾಪಾಡಿ."
        },
        "Tomato Bacterial Spot": {
            "description": "ಟೊಮ್ಯಾಟೋಗಳಲ್ಲಿ ಬ್ಯಾಕ್ಟೀರಿಯಲ್ ಸ್ಕಾಟ್  ಕ್ಸಾಂಥೋಮೊನಾಸ್ ಎಸ್ಪಿಪಿ. ಬ್ಯಾಕ್ಟೀರಿಯಾ ಒಡೆಯುವ ಮೂಲಕ ಉಂಟಾಗುತ್ತದೆ. ಇದು ಸಾಮಾನ್ಯವಾಗಿ ನೀರಿನಿಂದ ಹರಡುತ್ತದೆ, ಉದಾಹರಣೆಗೆ ಮಳೆ, ನೀರಾವರಿ ಅಥವಾ ಸಂಪೂರ್ಣವಾದ ನೆಲದಿಂದ.",
            "solution": "2.0 ಗ್ರಾಂ ಮ್ಯಾಂಕೋಜೆಬ್ ಅಥವಾ 3.0 ಗ್ರಾಂ ತಾಮ್ರದ ಆಕ್ಸಿಕ್ಲೊರೈಡ್ ಅಥವಾ 2.0 ಗ್ರಾಂ ಮೆಟಲಾಕ್ಷಿಲ್ ಮ್ಯಾಂಕೋಜೆಬ್‌ ಅನ್ನು ಪ್ರತಿ ಲೀಟರ್ ನೀರಿನಲ್ಲಿ ಬೆರೆಸಿ ಸಿಂಪಡಿಸಿ."
        },
        "Tomato Early Blight": {
            "description":  "ಆರಂಭದ ಕಳಕಳಿ  ಆಲ್ಟರ್ನೇರಿಯಾ ಸೋಲಾನಿ  ನಿಂದ ಉಂಟಾಗುವ ಸಾಮಾನ್ಯ ಹುಣಸು ಎಂಬುದು. ಇದು ಉಷ್ಣ, ತೇವಾಂಶಯುತ ಪರಿಸ್ಥಿತಿಯಲ್ಲಿ ಹರಡುತ್ತದೆ. ಗಾಳಿಯಿಂದ, ಮಳೆ ಮತ್ತು ಸಂಪೂರ್ಣವಾದ ಉಪಕರಣಗಳ ಮೂಲಕ.",
            "solution": "2.0 ಗ್ರಾಂ ಮ್ಯಾಂಕೋಜೆಬ್ ಅಥವಾ 3.0 ಗ್ರಾಂ ತಾಮ್ರದ ಆಕ್ಸಿಕ್ಲೊರೈಡ್ ಅಥವಾ 2.0 ಗ್ರಾಂ ಮೆಟಲಾಕ್ಷಿಲ್ ಮ್ಯಾಂಕೋಜೆಬ್‌ ಅನ್ನು ಪ್ರತಿ ಲೀಟರ್ ನೀರಿನಲ್ಲಿ ಬೆರೆಸಿ ಸಿಂಪಡಿಸಿ."
        },
        "Tomato Late Blight": {
            "description":  "ಬಳಕೆಯತ್ತ ತೆರೆಯುವ ಫೈಟೋಫthora ಇನ್ಫೆಸ್ಟಾನ್ಸ್  ನಿಂದ ಉಂಟಾಗುತ್ತದೆ, ಇದು ಟೊಮ್ಯಾಟೋ ಮತ್ತು ಆಲೂಗಡ್ಡೆಗಳನ್ನು ತ್ವರಿತವಾಗಿ ಹೊಡೆಯುತ್ತದೆ.",
            "solution": "2.0 ಗ್ರಾಂ ಮ್ಯಾಂಕೋಜೆಬ್ ಅಥವಾ 3.0 ಗ್ರಾಂ ತಾಮ್ರದ ಆಕ್ಸಿಕ್ಲೊರೈಡ್ ಅಥವಾ 2.0 ಗ್ರಾಂ ಮೆಟಲಾಕ್ಷಿಲ್ ಮ್ಯಾಂಕೋಜೆಬ್‌ ಅನ್ನು ಪ್ರತಿ ಲೀಟರ್ ನೀರಿನಲ್ಲಿ ಬೆರೆಸಿ ಸಿಂಪಡಿಸಿ."
        },
        "Tomato Leaf Mold": {
            "description": "ಈ ರೋಗವು ಪಸಲೋರಾ ಹಳದಿ  ಎಂಬ ಹುಣಸಿನಿಂದ ಉಂಟಾಗುತ್ತದೆ, ಇದು ತಾಪಮಾನ ಮತ್ತು ತೇವಾಂಶಯುತ ಪರಿಸ್ಥಿತಿಯಲ್ಲಿ ಹರಡುತ್ತದೆ.",
            "solution": "ಕಾರ್ಯಾಚರಣೆಯ ಅಗತ್ಯವಿಲ್ಲ; ಉತ್ತಮ ಬೆಳೆಯುವ ಪರಿಸ್ಥಿತಿಗಳನ್ನು ಕಾಪಾಡಿ."
        },
        "Tomato Septoria Leaf Spot": {
            "description":"ಈ ಹುಣಸು  ಸೆಪ್ಟೋರಿಯಾ ಲೈಕೋಪರ್ಸಿಸಿ  ಮೂಲಕ ಉಂಟಾಗುತ್ತದೆ, ಇದು ತೇವಾಂಶಯುತ ಪರಿಸ್ಥಿತಿಯಲ್ಲಿ ಸಾಮಾನ್ಯವಾಗಿದೆ. ಈ ಹುಣಸು ಸಸ್ಯಗಳ ಮೇಲಿನ ಕೊನೆಯಲ್ಲಿ ಬೀರುವ ಮೂಲಕ ಹರಡುತ್ತದೆ.",
            "solution":"2.0 ಗ್ರಾಂ ಮ್ಯಾಂಕೋಜೆಬ್ ಅಥವಾ 3.0 ಗ್ರಾಂ ತಾಮ್ರದ ಆಕ್ಸಿಕ್ಲೊರೈಡ್ ಅಥವಾ 2.0 ಗ್ರಾಂ ಮೆಟಲಾಕ್ಷಿಲ್ ಮ್ಯಾಂಕೋಜೆಬ್‌ ಅನ್ನು ಪ್ರತಿ ಲೀಟರ್ ನೀರಿನಲ್ಲಿ ಬೆರೆಸಿ ಸಿಂಪಡಿಸಿ"
        },
        "Tomato Spider Mites Two_Spotted Spider Mite": {
            "description":"ಮೀಟ್ನ ಭಾಗವಿಲ್ಲದ ಟೆಟ್ರಾನಿಕಸ್ ಉರ್ಟಿಕೇ  ಎಂಬ ನೂಕು ಹಕ್ಕಿಗಳು,  ತಂಪಾದ, ತೀವ್ರವಾದ ಪರಿಸ್ಥಿತಿಯಲ್ಲಿ ಹರಡುತ್ತಾರೆ. ಅವರು ಎಲೆಗಳ ಕೆಳಗೆ ಆಹಾರ ಸೇವಿಸುತ್ತಾರೆ.",
            "solution":  "2.0 ಗ್ರಾಂ ಮೆಟಲಾಕ್ಷಿಲ್ ಮ್ಯಾಂಕೋಜೆಬ್ ಅಥವಾ ಪ್ರತಿ ಲೀಟರ್ ನೀರಿಗೆ 2 ಮಿಲಿ ಪ್ರೋಫೆನೋಫಾಸ್ ಅಥವಾ 2 ಮಿಲಿ ಅಬಾಮೆಕ್ಟಿನ್ ಅನ್ನು ಬೆರೆಸಿ ಸಿಂಪಡಿಸಿ."
        },
        "Tomato Target Spot": {
            "description":  "ಈ ರೋಗವು ಕೋರಿನೆಸ್ಪೊರಾ ಕ್ಯಾಸಿಕೋಲಾ ಎಂಬ ಹುಣಸಿನಿಂದ ಉಂಟಾಗುತ್ತದೆ, ಇದು ಟೊಮ್ಯಾಟೋ ಮತ್ತು ಇತರ ಸಸ್ಯಗಳನ್ನು ಹೊಡೆದು ಹೋಗುತ್ತದೆ.",
            "solution": "ಟೊಮೇಟೊ ಗುರಿಚುಕ್ಕಿ ರೋಗ ನಿಯಂತ್ರಣಕ್ಕೆ ಕಾಪರ್ ಆಕ್ಸಿಕೋರೈಡ್ ಅಥವಾ ಮ್ಯಾಂಕೋಜೆಬ್ ಸಿಂಪಡಿಸಿ."
        },
        "Tomato YellowLeaf Curl Virus": {
            "description": "TYLCV  ಸಸ್ಯವನ್ನು ಹುಟ್ಟಿಸುವ ಶ್ವೇತಪಕ್ಷಿಗಳಿಂದ ಹರಡುತ್ತದೆ. ಈ ವೈರಸ್ ಟೊಮ್ಯಾಟೋ ಸಸ್ಯದ ಬೆಳವಣಿಗೆಗೆ ಹಾನಿಕಾರಿಯಾಗುತ್ತದೆ.",
            "solution": "ಟೊಮ್ಯಾಟೊ ಹಳದಿ ಎಲೆ ಸುರುಳಿ ವೈರಸ್‌ಗೆ ನಿರ್ದಿಷ್ಟ ರಾಸಾಯನಿಕ ನಿಯಂತ್ರಣವಿಲ್ಲ. ಆದ್ದರಿಂದ, ರೋಗಮುಕ್ತ ಸಸಿಗಳನ್ನು ನೆಡುವುದು, ಬಿಳಿನೊಣಗಳ ನಿಯಂತ್ರಣ, ಸೋಂಕಿತ ಸಸ್ಯಗಳ ನಾಶ, ಬೆಳೆ ತಿರುಗುವಿಕೆ ಮತ್ತು ರೋಗ ನಿರೋಧಕ ತಳಿಗಳ ಬಳಕೆಯಿಂದ ತಡೆಗಟ್ಟಬಹುದು."
        },
        "Tomato Mosaic Virus": {
            "description": "TYLCV is a viral disease primarily spread by whiteflies. The virus affects tomato plant growth and reduces yield.",
            "solution": "Control Tomato Yellow Leaf Curl Virus (TYLCV) in tomatoes by planting resistant varieties, controlling whiteflies (the virus vector) with insecticides or biological control agents, and removing infected plants."
        },
        "Tomato Healthy": {
            "description": "ಆರೋಗ್ಯಕರ ಟೊಮ್ಯಾಟೋ ಸಸ್ಯಗಳು ದೃಢವಾದ, ಉತ್ತೇಜಕ ಎಲೆಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತವೆ ಮತ್ತು ಯಾವುದೇ ರೋಗ ಅಥವಾ ಕೀಟ ಹಾನಿಯ ಲಕ್ಷಣಗಳನ್ನು ತೋರಿಸುತ್ತವೆ.",
            "solution": "ಕಾರ್ಯಾಚರಣೆಯ ಅಗತ್ಯವಿಲ್ಲ; ಉತ್ತಮ ಬೆಳೆಯುವ ಪರಿಸ್ಥಿತಿಗಳನ್ನು ಕಾಪಾಡಿ."
        }
    }
}
